app/controllers/posts_controller.rb

	def update
		@post = Post.find(params[:id])
		@post.title = params[:title]
	  @post.description = params[:description]
	  @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Test"], ["description", "Testing this out"], ["updated_at", "2017-05-03 17:25:17.346323"], ["id", 1]]